public class Task_2 {
    /*
    Сила тяжести на Луне примерно равна 17%, напишите программу, которая вычисляет ваш вес на Луне.
     */
    public static void main(String[] args) {
        double p = 45;
        double pl = 0.17*p;
        System.out.println("My weight at Luna: "+pl);
    }
}
